## Plan Result (fxa-webhook-proxy-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/98446)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 2 to change, 1 to destroy.</code></pre>

* Update
  * aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9
  * aws_lambda_function.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_06645171
* Replace
  * aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512 must be replaced
+/- resource "aws_api_gateway_deployment" "apigateway-lambda_api-gateway-deployment_3AF9B512" {
      ~ created_date  = "2024-03-21T21:08:18Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:996905175585:b1aoz7w8yj/" -> (known after apply)
      ~ id            = "cyae9o" -> (known after apply)
      ~ invoke_url    = "https://b1aoz7w8yj.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          - "deployedAt"   = "1711055256176" -> null
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9 will be updated in-place
  ~ resource "aws_api_gateway_stage" "apigateway-lambda_api-gateway-stage_E95B0DF9" {
      ~ deployment_id         = "cyae9o" -> (known after apply)
        id                    = "ags-b1aoz7w8yj-prod"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # aws_lambda_function.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_06645171 will be updated in-place
  ~ resource "aws_lambda_function" "apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_06645171" {
        id                             = "FxAWebhookProxy-Prod-ApiGateway-FxA-Events-Function"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:FxAWebhookProxy-Prod-ApiGateway-FxA-Events-Function:1047" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:FxAWebhookProxy-Prod-ApiGateway-FxA-Events-Function:1047/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "1047" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "GIT_SHA"            = (sensitive value) -> null
                # (3 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  + apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_lambda-code-deploy_lambda_codedeploy_app_D98131CE   = "FxAWebhookProxy-Prod-ApiGateway-FxA-Events-Lambda"
  + apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_lambda-code-deploy_lambda_codedeploy_group_1BB200A2 = "FxAWebhookProxy-Prod-ApiGateway-FxA-Events-Lambda"
  + apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_lambda_arn_7853CD90                                 = "arn:aws:lambda:us-east-1:996905175585:function:FxAWebhookProxy-Prod-ApiGateway-FxA-Events-Function"
  + apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_lambda_function_name_A40A9086                       = "FxAWebhookProxy-Prod-ApiGateway-FxA-Events-Function"
  + apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_lambda_version_arn_7DB576D5                         = "arn:aws:lambda:us-east-1:996905175585:function:FxAWebhookProxy-Prod-ApiGateway-FxA-Events-Function:DEPLOYED"
  + proxy-lambda_fxa-events-sqs-lambda_lambda-code-deploy_lambda_codedeploy_app_0DC459EC                             = "FxAWebhookProxy-Prod-Sqs-FxA-Events-Lambda"
  + proxy-lambda_fxa-events-sqs-lambda_lambda-code-deploy_lambda_codedeploy_group_14362602                           = "FxAWebhookProxy-Prod-Sqs-FxA-Events-Lambda"
  + proxy-lambda_fxa-events-sqs-lambda_lambda_arn_E7C079EE                                                           = "arn:aws:lambda:us-east-1:996905175585:function:FxAWebhookProxy-Prod-Sqs-FxA-Events-Function"
  + proxy-lambda_fxa-events-sqs-lambda_lambda_function_name_E3D8507A                                                 = "FxAWebhookProxy-Prod-Sqs-FxA-Events-Function"
  + proxy-lambda_fxa-events-sqs-lambda_lambda_version_arn_C788D134                                                   = "arn:aws:lambda:us-east-1:996905175585:function:FxAWebhookProxy-Prod-Sqs-FxA-Events-Function:DEPLOYED"
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"7d06ce2a-42d1-449f-985e-f1323c3c1a3d","JobName":"fxa-webhook-proxy_infrastructure_plan_prod","PRNumber":331,"Program":"tfcmt","SHA1":"91abaa5e48b7c39f40f45b30565614e9c461edd2","Target":"fxa-webhook-proxy-cdk","Vars":{}} -->